In [5]:
import pandas as pd

# DataFrame

## Creating DF from dict

In [4]:
data = {
    'Name' : ['Alice', 'Bob', 'Charlie', 'David', 'Eve'],
    'Math' : [76, 68, 87, 56, 35],
    'English' : [69, 87, 81, 66, 59],
    'Science' : [92, 65, 78, 46, 66],
}
df = pd.DataFrame(data)
df

      Name  Math  English  Science
0    Alice    76       69       92
1      Bob    68       87       65
2  Charlie    87       81       78
3    David    56       66       46
4      Eve    35       59       66

## Viewing data in dataframe

In [7]:
df.head(2)

    Name  Math  English  Science
0  Alice    76       69       92
1    Bob    68       87       65

In [8]:
df.tail(3)

      Name  Math  English  Science
2  Charlie    87       81       78
3    David    56       66       46
4      Eve    35       59       66

In [9]:
df.sample(2, random_state=43)

      Name  Math  English  Science
3    David    56       66       46
2  Charlie    87       81       78

In [10]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 4 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   Name     5 non-null      object
 1   Math     5 non-null      int64
 2   English  5 non-null      int64
 3   Science  5 non-null      int64
dtypes: int64(3), object(1)
memory usage: 292.0+ bytes

## Adding a new column

In [12]:
df['Total'] = df[['Math', 'English', 'Science']].sum(axis=1)

In [13]:
df

      Name  Math  English  Science  Total
0    Alice    76       69       92    237
1      Bob    68       87       65    220
2  Charlie    87       81       78    246
3    David    56       66       46    168
4      Eve    35       59       66    160

## Dropping a column

In [15]:
df_no_ingles = df.drop(columns=['English'])
df_no_ingles

      Name  Math  Science  Total
0    Alice    76       92    237
1      Bob    68       65    220
2  Charlie    87       78    246
3    David    56       46    168
4      Eve    35       66    160

In [16]:
df

      Name  Math  English  Science  Total
0    Alice    76       69       92    237
1      Bob    68       87       65    220
2  Charlie    87       81       78    246
3    David    56       66       46    168
4      Eve    35       59       66    160